In [5]:
import pandas as pd
import numpy as np

# Series

## Series generation

### List/numpy array

In [6]:
l1 = [1, 2, 3, 5]
index = [3, 5, 6, 9]
pd.Series(l1, index=index)

#index - default or spe

3    1
5    2
6    3
9    5
dtype: int64

### Dictionary

In [7]:
d1 = {'a': 1, 'b': 2, 'c': 3, 'd': 4}

pd.Series(d1)

a    1
b    2
c    3
d    4
dtype: int64

### Nested lists

In [8]:
series1 = pd.Series([['Red', 'Green', 'White'], ['Red', 'Black'], ['Yellow']])
series1

0    [Red, Green, White]
1           [Red, Black]
2               [Yellow]
dtype: object

In [9]:
series2 = series1.apply(pd.Series).stack()
series2

0  0       Red
   1     Green
   2     White
1  0       Red
   1     Black
2  0    Yellow
dtype: object

In [10]:
series2.reset_index(drop=True)

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

## Hierarchial index generation

In [11]:
data = pd.Series(np.random.randn(10),
                 index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.048379
   2   -0.417309
   3   -0.154179
b  1    0.487519
   2    0.430742
   3   -0.754558
c  1    0.592900
   2    0.937308
d  2   -0.607008
   3    1.158539
dtype: float64

### Index/Slice Multi-index

#### On the same level

In [12]:
data['b':'c']

b  1    0.487519
   2    0.430742
   3   -0.754558
c  1    0.592900
   2    0.937308
dtype: float64

In [13]:
data[:, 2]

a   -0.417309
b    0.430742
c    0.937308
d   -0.607008
dtype: float64

#### On different levels

In [14]:
data['a', 2]

-0.4173086529982225

### Re-order multi-index series into dataframe (unstack)

In [15]:
df = data.unstack()
df
# The reverse can be performed - stack()

          1         2         3
a  0.048379 -0.417309 -0.154179
b  0.487519  0.430742 -0.754558
c  0.592900  0.937308       NaN
d       NaN -0.607008  1.158539

### Re-order dataframe into multi-index series (stack)

In [16]:
df.stack()

a  1    0.048379
   2   -0.417309
   3   -0.154179
b  1    0.487519
   2    0.430742
   3   -0.754558
c  1    0.592900
   2    0.937308
d  2   -0.607008
   3    1.158539
dtype: float64

### Specifying which levels to stack/unstack

In [17]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                 index=pd.Index(['Ohio', 'Colorado'], name='state'),
                 columns=pd.Index(['one', 'two', 'three'], name='number'))
result = data.stack()
print(data,result,sep='\n')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5
state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

#### Stack

In [18]:
data.stack(level=0)

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [19]:
data.stack('number')
# value called will be transformed from horizontal to vertical headers

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

#### Unstack

In [20]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [21]:
result.unstack('number')
# Value called will be transformed from vertical to horizontal headers

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

## Mathematical operations

In [22]:
series1 = pd.Series([2, 4, 6, 8, 10])
series2 = pd.Series([1, 3, 5, 7, 9])
print(series1, series2, sep='\n')

0     2
1     4
2     6
3     8
4    10
dtype: int64
0    1
1    3
2    5
3    7
4    9
dtype: int64

In [23]:
series1 + series2

0     3
1     7
2    11
3    15
4    19
dtype: int64

In [24]:
series1 / series2

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

## Boolean operations

### Basic comparison between 2 series

In [25]:
series1 > series2

0    True
1    True
2    True
3    True
4    True
dtype: bool

### Threshold value - values above 5

In [26]:
series1 = pd.Series(np.random.randint(0, 10, size=10))
series1

0    6
1    5
2    0
3    1
4    3
5    7
6    8
7    0
8    0
9    2
dtype: int32

In [27]:
series1 > 5

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7    False
8    False
9    False
dtype: bool

#### Selecting original data based on boolean conditions

In [28]:
series1[series1 > 5]

0    6
5    7
6    8
dtype: int32

## Indexing and slicing

### Appending one series to another

In [29]:
np.random.seed(0)
series1 = pd.Series(np.random.randint(0, 10, size=3))

np.random.seed(1)
series2 = pd.Series(np.random.randint(0, 10, size=3))

print(series1, series2, sep='\n')

0    5
1    0
2    3
dtype: int32
0    5
1    8
2    9
dtype: int32

In [30]:
series3 = series1.append(series2)
series3

0    5
1    0
2    3
0    5
1    8
2    9
dtype: int32

#### Reset the index of series

In [31]:
series3.reset_index(drop=True)

0    5
1    0
2    3
3    5
4    8
5    9
dtype: int32

### Rename index

In [32]:
series1 = pd.Series(data=[1, 2, 3, 4, 5], index=['A', 'B', 'C', 'D', 'E'])
series1

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [33]:
series2 = series1.reindex(index=['B', 'A', 'C', 'D', 'E'])
series2

B    2
A    1
C    3
D    4
E    5
dtype: int64

### Selecting values via index

In [34]:
series1 = pd.Series(data=[1, 2, 3, 4, 5], index=['A', 'B', 'C', 'D', 'E'])
series1

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [35]:
series1['A']

1

In [36]:
series1['A':'C'] = np.linspace(10, 12, 3)
series1
#Note that the end is included

A    10.0
B    11.0
C    12.0
D     4.0
E     5.0
dtype: float64

## Sorting

In [37]:
series1 = pd.Series(['200', '100', 'python', '300.12', '400'])
series1

0       200
1       100
2    python
3    300.12
4       400
dtype: object

In [38]:
series2 = series1.sort_values().reset_index(drop=True)
series2

0       100
1       200
2    300.12
3       400
4    python
dtype: object

## Data cleaning in Series

### Convert all non-integer entries to NaN

In [39]:
series1 = pd.Series([100, 200, 'python', 300.12, 400])
series1

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [40]:
pd.to_numeric(series1, errors='coerce')

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

# Dataframe

## Dataframe generation

### Generate random df

In [41]:
df = pd.DataFrame(np.random.randint(0, 100, size=(3, 3)),
                  columns=list('abc'),
                  index=['I', 'II', 'III'])
df

      a   b   c
I    75   5  79
II   64  16   1
III  76  71   6

### From dictionary of Series, key = col header

In [42]:
np.random.seed(0)
series1 = pd.Series(np.random.randint(0, 10, size=3))
np.random.seed(1)
series2 = pd.Series(np.random.randint(0, 10, size=3))

In [43]:
df = pd.DataFrame({
    'Header1': series1,
    'Header2': series2
},
                  columns=['Header2', 'Header1', 'Empty'])
df

# specify order of columns using columns= , and if there is a new col it will be created with NaN values

   Header2  Header1 Empty
0        5        5   NaN
1        8        0   NaN
2        9        3   NaN

### From dictionary

In [44]:
exam_data = {
    'name': [
        'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
        'Matthew', 'Laura', 'Kevin', 'Jonas'
    ],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify':
    ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

# dictionary key will become the col header, while you need to set the index yourself using a Python list

In [45]:
exam_df = pd.DataFrame(exam_data, index=labels)
exam_df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### Selecting specific columns to be included in df

In [46]:
pd.DataFrame(exam_data, index=labels, columns=['name','score'])

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

## Multi-index generation

In [47]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

### Naming hierarchial levels

In [48]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### Index/Slice

In [49]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### Re-order/swap levels

In [50]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

## DataFrame info

In [51]:
exam_df.info(null_counts=True)

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

## Indexing and slicing data

In [76]:
exam_df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### Selecting a column

#### By explicit index

In [78]:
exam_df['name']

a    Anastasia
b         Dima
c    Katherine
d        James
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object

In [79]:
exam_df[['name', 'qualify']]

        name qualify
a  Anastasia     yes
b       Dima      no
c  Katherine     yes
d      James      no
e      Emily      no
f    Michael     yes
g    Matthew     yes
h      Laura      no
i      Kevin      no
j      Jonas     yes

#### By implicit index

In [90]:
exam_df.iloc[:, 0]
#Disadvantage when you need multiple columns that are not beside each other

a    Anastasia
b         Dima
c    Katherine
d        James
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object

### Selecting a row

#### By iloc

In [218]:
exam_df.reset_index()
exam_df
# Note that .iloc returns a Pandas Series when one row is selected,
# and a Pandas DataFrame when multiple rows are selected,
# or if any column in full is selected.
# To counter this, pass a single-valued list if you require DataFrame output.

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

In [219]:
exam_df.loc[['Anastasia']]

           score  attempts qualify
name
Anastasia   15.0         1     yes

In [221]:
exam_df.loc['Anastasia']
# note the difference

score        15
attempts      1
qualify     yes
Name: Anastasia, dtype: object

In [96]:
exam_df.iloc[:3, :]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [98]:
exam_df['a':'c']
# This method does not work for selecting a single row i.e. exam_df['a']

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

#### By re-indexing an existing column and calling the value in the column

In [125]:
exam_df.set_index('name', inplace=True)

KeyError: 'name'

In [126]:
exam_df

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

In [127]:
exam_df.loc['Jonas']

score        19
attempts      1
qualify     yes
Name: Jonas, dtype: object

In [129]:
exam_df.loc[['Kevin', 'Jonas']]

       score  attempts qualify
name
Kevin    8.0         2      no
Jonas   19.0         1     yes

### Selecting multiple columns and rows

In [139]:
exam_df

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

In [140]:
exam_df.loc['Anastasia', 'qualify']

'yes'

In [147]:
exam_df.loc['Anastasia':'Emily', 'qualify']

name
Anastasia    yes
Dima          no
Katherine    yes
James         no
Emily         no
Name: qualify, dtype: object

In [146]:
exam_df.loc[['Anastasia', 'Jonas'], ['score', 'attempts']]

           score  attempts
name
Anastasia   12.5         1
Jonas       19.0         1

### Assignment

In [177]:
exam_df

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

In [179]:
exam_df.loc['Anastasia', 'score'] = 15
exam_df

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

### Appending/Dropping

In [191]:
exam_df

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

#### Appending entire row

In [194]:
exam_df.loc['Suresh'] = [15.5, 1, 'yes']
exam_df

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

In [216]:
#method 2 - advantage is you don't need to know what is the last index used
addon = {'a': 10, 'b': 11, 'c': 12}
df = df.append(addon, ignore_index=True)
df

      a     b     c  col1  col2  col3
0  87.0   7.0  26.0   NaN   NaN   NaN
1  25.0  22.0   9.0   NaN   NaN   NaN
2  67.0  23.0  27.0   NaN   NaN   NaN
3   NaN   NaN   NaN  10.0  11.0  12.0

#### Appending entire column

In [232]:
color = [
    'Red', 'Blue', 'Orange', 'Red', 'White', 'White', 'Blue', 'Green', 'Green',
    'Red', 'Black'
]

if (len(color) == exam_df.shape[0]):
    exam_df['color'] = color
    print(exam_df)
else:
    print('number of rows do not match')

           score  attempts qualify   color
name
Anastasia   15.0         1     yes     Red
Dima         9.0         3      no    Blue
Katherine   16.5         2     yes  Orange
James        NaN         3      no     Red
Emily        9.0         2      no   White
Michael     20.0         3     yes   White
Matthew     14.5         1     yes    Blue
Laura        NaN         1      no   Green
Kevin        8.0         2      no   Green
Jonas       19.0         1     yes     Red
Suresh      15.5         1     yes   Black

#### Dropping row via index

In [192]:
exam_df.drop('Suresh')

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

#### Dropping column

In [204]:
exam_df
exam_df.pop('attempts')

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

## Sorting

In [195]:
exam_df

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

In [198]:
exam_df.sort_values(by=['name', 'score'], ascending=[True, False])

# note the formatting, you can sort by multiple conditions, in the logical order.
# i.e. all the 'Zs' will be grouped together, then sort by score from lowest to highest

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Emily        9.0         2      no
James        NaN         3      no
Jonas       19.0         1     yes
Katherine   16.5         2     yes
Kevin        8.0         2      no
Laura        NaN         1      no
Matthew     14.5         1     yes
Michael     20.0         3     yes
Suresh      15.5         1     yes

## Boolean operations

In [148]:
exam_df

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

### Generating boolean masks from dataframe for 1 condition

In [149]:
exam_df['attempts'] >= 2

name
Anastasia    False
Dima          True
Katherine     True
James         True
Emily         True
Michael       True
Matthew      False
Laura        False
Kevin         True
Jonas        False
Name: attempts, dtype: bool

### Generating boolean masks from dataframe for for 2 conditions

In [167]:
(exam_df['score'] <= 20) & (exam_df['score'] >= 15)

name
Anastasia    False
Dima         False
Katherine     True
James        False
Emily        False
Michael       True
Matthew      False
Laura        False
Kevin        False
Jonas         True
Name: score, dtype: bool

In [169]:
exam_df['score'].between(15, 20)

name
Anastasia    False
Dima         False
Katherine     True
James        False
Emily        False
Michael       True
Matthew      False
Laura        False
Kevin        False
Jonas         True
Name: score, dtype: bool

### Selecting data from original value array based on boolean mask

In [152]:
exam_df.loc[exam_df['attempts'] >= 2, ['score', 'attempts', 'qualify']]

           score  attempts qualify
name
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Kevin        8.0         2      no

In [171]:
exam_df[(exam_df['score'] <= 20) & (exam_df['score'] >= 15)]
exam_df[exam_df['score'].between(15, 20)]
#they are equivalent

           score  attempts qualify
name
Katherine   16.5         2     yes
Michael     20.0         3     yes
Jonas       19.0         1     yes

#### select the rows where the score is missing, i.e. is NaN.

In [233]:
exam_df

           score  attempts qualify   color
name
Anastasia   15.0         1     yes     Red
Dima         9.0         3      no    Blue
Katherine   16.5         2     yes  Orange
James        NaN         3      no     Red
Emily        9.0         2      no   White
Michael     20.0         3     yes   White
Matthew     14.5         1     yes    Blue
Laura        NaN         1      no   Green
Kevin        8.0         2      no   Green
Jonas       19.0         1     yes     Red
Suresh      15.5         1     yes   Black

In [235]:
exam_df.loc[exam_df['score'].isna()]

#use isna() not isnull()

       score  attempts qualify  color
name
James    NaN         3      no    Red
Laura    NaN         1      no  Green

#### Practise

##### Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [176]:
exam_df[(exam_df['attempts'] < 2) & (exam_df['score'] > 15)]

       score  attempts qualify
name
Jonas   19.0         1     yes

## Aggregation functions

In [180]:
exam_df

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

### Sum of a column

In [185]:
exam_df['attempts'].sum()
# When summing data, NA (missing) values will be treated as zero.

19

### Mean of a column

In [186]:
exam_df['score'].mean()

13.875

## Cleaning data

### Converting yes/no to Boolean

In [199]:
exam_df

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

In [200]:
exam_df['qualify'] = exam_df['qualify'].map({'yes': True, 'no': False})
exam_df

           score  attempts  qualify
name
Anastasia   15.0         1     True
Dima         9.0         3    False
Katherine   16.5         2     True
James        NaN         3    False
Emily        9.0         2    False
Michael     20.0         3     True
Matthew     14.5         1     True
Laura        NaN         1    False
Kevin        8.0         2    False
Jonas       19.0         1     True
Suresh      15.5         1     True

In [202]:
#method 2
exam_df['qualify'] = exam_df['qualify'].replace(to_replace=[True, False],
                                                value=['yes', 'no'])
exam_df

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

### Renaming columns

In [56]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [58]:
col_mapping = {
    'col1': 'Column1',
    'col2': 'Column2',
    'col3': 'Column3'
}

df = df.rename(columns=col_mapping, copy=False)
df

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

### Reordering columns and rows

In [213]:
df = pd.DataFrame(np.random.randint(0, 100, size=(3, 3)),
                  columns=list('abc'),
                  index=['I', 'II', 'III'])
df

      a   b   c
I    87   7  26
II   25  22   9
III  67  23  27

In [214]:
df.reindex(['I', 'II', 'III', 'IV'], columns=list('abcd'))

        a     b     c   d
I    87.0   7.0  26.0 NaN
II   25.0  22.0   9.0 NaN
III  67.0  23.0  27.0 NaN
IV    NaN   NaN   NaN NaN

### NaN values

#### Replace NaN values with the mean of the column

In [222]:
exam_df

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

In [224]:
exam_df1 = exam_df.fillna(exam_df.mean())
exam_df1

               score  attempts qualify
name
Anastasia  15.000000         1     yes
Dima        9.000000         3      no
Katherine  16.500000         2     yes
James      14.055556         3      no
Emily       9.000000         2      no
Michael    20.000000         3     yes
Matthew    14.500000         1     yes
Laura      14.055556         1      no
Kevin       8.000000         2      no
Jonas      19.000000         1     yes
Suresh     15.500000         1     yes

#### Replace NaN values with forward/backward value respectively

In [225]:
exam_df1 = exam_df.fillna(method='ffill')
exam_df1

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James       16.5         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura       14.5         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

In [226]:
exam_df1 = exam_df.fillna(method='bfill')
exam_df1

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        9.0         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        8.0         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

In [227]:
exam_df

           score  attempts qualify
name
Anastasia   15.0         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes
Suresh      15.5         1     yes

#### Drop all rows with na

In [94]:
df = pd.DataFrame({
    'Animal': ['Falcon', 'Falcon', 'Parrot', np.nan],
    'Max Speed': [380., 370., np.nan, 26.],
    'FRando': [1, 1, 3, 4]
})
df

   Animal  Max Speed  FRando
0  Falcon      380.0       1
1  Falcon      370.0       1
2  Parrot        NaN       3
3     NaN       26.0       4

In [95]:
df.dropna(axis=0)

   Animal  Max Speed  FRando
0  Falcon      380.0       1
1  Falcon      370.0       1

### Replace sentinel values for NA to Pandas-readable NaN

In [92]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

#### One value to one

In [93]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

#### Many value to one

In [96]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

#### Many value to many

In [97]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Duplicates

In [80]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4,'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

#### Boolean check for duplicates

In [81]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

#### 'drop_duplicate' which acts as boolean masking

In [82]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

#### Specifying column to check for duplicates

In [83]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [85]:
data.drop_duplicates(['k1'])
# by default keep the first observed value combination

    k1  k2  v1
0  one   1   0
3  two   3   3

### Data transformation using mapping

In [87]:
data = pd.DataFrame({
    'food': [
        'bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
        'pastrami', 'honey ham', 'nova lox'
    ],
    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
})

#### Add new column to show which food came from what animal

In [88]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [90]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data
# some are upper and lower case, so need to convert all to lower case

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## Aggregation functions

### Groupby method

In [3]:
df = pd.DataFrame({
    'Animal': ['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    'Max Speed': [380., 370., 24., 26.],
    'FRando': [1, 1, 3, 4]
})
df

   Animal  Max Speed  FRando
0  Falcon      380.0       1
1  Falcon      370.0       1
2  Parrot       24.0       3
3  Parrot       26.0       4

#### Mean

In [13]:
df.groupby('Animal').mean().reset_index()

   Animal  Max Speed  FRando
0  Falcon      375.0     1.0
1  Parrot       25.0     3.5

#### Median

In [14]:
df.groupby('Animal').median().reset_index()

   Animal  Max Speed  FRando
0  Falcon      375.0     1.0
1  Parrot       25.0     3.5

#### Max/Min

In [15]:
df.groupby('Animal').max().reset_index()

   Animal  Max Speed  FRando
0  Falcon      380.0       1
1  Parrot       26.0       4

In [8]:
df.groupby('Animal').min()

        Max Speed  FRando
Animal
Falcon      370.0       1
Parrot       24.0       3

#### Count number of occurence

In [9]:
df1 = pd.DataFrame({
    'name': [
        'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
        'Matthew', 'Laura', 'Kevin', 'Jonas'
    ],
    'city': [
        'California', 'Los Angeles', 'California', 'California', 'California',
        'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles'
    ]
})
df1

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

In [12]:
dfnew = df1.groupby(['city']).count().reset_index()
dfnew

          city  name
0   California     4
1      Georgia     2
2  Los Angeles     4

## Merge

### 1 to many

In [5]:
df4 = pd.DataFrame({
    'group': ['Accounting', 'Engineering', 'HR'],
    'supervisor': ['Carly', 'Guido', 'Steve']
})
print(df3)
print(df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [7]:
pd.merge(df3, df4, on='group')

# Specify which column key to merge on explicitly

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

### Many to Many

In [2]:
df5 = pd.DataFrame({
    'group':
    ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
    'skills': [
        'math', 'spreadsheets', 'coding', 'linux', 'spreadsheets',
        'organization'
    ]
})
print(df1)
print(df5)

NameError: name 'df1' is not defined

In [106]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### 1-to-1

#### Using 'on' parameter (for consistent column names + values under)

In [3]:
df1 = pd.DataFrame({
    'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']
})
df2 = pd.DataFrame({
    'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
    'hire_date': [2004, 2008, 2012, 2014]
})
print(df1, df2, sep='\n')

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [4]:
df3 = pd.merge(df1, df2, on='employee', sort=True)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### Using 'left on/right on' parameter (for inconsistent column names + consistent column values)

In [70]:
df3 = pd.DataFrame({
    'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'salary': [70000, 80000, 120000, 90000]
})
print(df1)
print(df3)
# employee on left df, name on right df

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [78]:
pd.merge(df1, df3, left_on="employee", right_on="name", sort=True).drop('name',
                                                                        axis=1)

# drop argument needed to remove redundant 'name' column

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

#### Using index

In [76]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a)
print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [79]:
pd.merge(df1a, df2a, left_index=True, right_index=True, sort=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

#### Combining different methods

In [82]:
print(df1a)
print(df3)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [85]:
pd.merge(df1a, df3, left_index=True,
         right_on='name').reindex(columns=['name', 'group', 'salary'])
#returns name, need to reorder column

   name        group  salary
0   Bob   Accounting   70000
1  Jake  Engineering   80000
2  Lisa  Engineering  120000
3   Sue           HR   90000

#### Using 'suffix' parameter to deal with consistent column name + inconsistent column values

In [86]:
df8 = pd.DataFrame({
    'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'rank': [1, 2, 3, 4]
})

df9 = pd.DataFrame({
    'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'rank': [3, 1, 4, 2]
})
print(df8)
print(df9)

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [87]:
print(pd.merge(df8, df9, on="name"))
#default results in suffix _x and _y for consistent column name but conflicting values

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [88]:
#If these defaults are inappropriate, it is possible to specify a custom suffix using suffixes argument
pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

#### Using 'how' parameter to specify type of merger (union/intersection)

inner

outer

left

right

In [89]:
df6 = pd.DataFrame(
    {
        'name': ['Peter', 'Paul', 'Mary'],
        'food': ['fish', 'beans', 'bread']
    },
    columns=['name', 'food'])
df7 = pd.DataFrame({
    'name': ['Mary', 'Joseph'],
    'drink': ['wine', 'beer']
},
                   columns=['name', 'drink'])
print(df6)
print(df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer

In [93]:
pd.merge(df6, df7, how='inner')
# intersection

   name   food drink
0  Mary  bread  wine

In [92]:
pd.merge(df6, df7, how='outer')
# union

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [94]:
pd.merge(df6, df7, how='left')
#uses the columns in the left dataframe as reference for intersection

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [95]:
pd.merge(df6, df7, how='right')
#uses the columns in the right dataframe as reference for intersection

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

## Concat (combining dataframes)

### Basic concat with non-clashing indexes

In [9]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [15]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

#### 'axis' parameter to determine concat row/col-wise

In [12]:
pd.concat([s1, s2, s3], axis=0)
# row-wise

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [16]:
pd.concat([s1, s2, s3], axis=1, sort=False)
# col-wise

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

#### 'join' parameter to determine Intersection/Union merge

In [23]:
s4 = pd.concat([s1 * 5, s3])
print(s1,s4,sep='\n')

a    0
b    1
dtype: int64
a    0
b    5
f    5
g    6
dtype: int64

In [26]:
pd.concat([s1, s4], axis=1, join='outer', sort=False)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [27]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

#### 'join_axes' parameter to select specific indexes to merge

In [28]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

#### 'keys' parameter to create hierarchial indexing

In [33]:
result = pd.concat([s1, s1, s3], axis=0, keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

#### 'ignore_index' parameter to continue append like a list

In [39]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
print(df1,df2,sep='\n')

pd.concat([df1,df2],axis=0, ignore_index=True, sort=False)

          a         b         c         d
0 -1.449161  0.786423 -1.957325 -0.401109
1  0.239554 -0.631963 -2.814907  0.616607
2 -0.397610  0.404251  1.054334 -1.140990
          b         d         a
0 -0.117641  2.132216  0.014712
1  0.613682 -0.216784 -1.479894

          a         b         c         d
0 -1.449161  0.786423 -1.957325 -0.401109
1  0.239554 -0.631963 -2.814907  0.616607
2 -0.397610  0.404251  1.054334 -1.140990
3  0.014712 -0.117641       NaN  2.132216
4 -1.479894  0.613682       NaN -0.216784

### Combine first

In [42]:
df1 = pd.DataFrame({'A': [1, 0], 'B': [None, 4]})
df2 = pd.DataFrame({'A': [1, 1], 'B': [3, 3]})
print(df1,df2,sep='\n')
df1.combine_first(df2)

# Take non-null values in df1 + pad df2 values for null df1 values

   A    B
0  1  NaN
1  0  4.0
   A  B
0  1  3
1  1  3

   A    B
0  1  3.0
1  0  4.0

In [46]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64),index=['f', 'e', 'd', 'c', 'b', 'a'])
b[-1] = np.nan
print(a,b,sep='\n')

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64
f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [47]:
print(b[:-2],a[2:],sep='\n')

f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [48]:
b[:-2].combine_first(a[2:])
# Take all non-null of b and pad with a

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

## Mathematical operations

In [30]:
area = pd.Series({
    'Alaska': 1723337,
    'Texas': 695662,
    'California': 423967
},
                 name='area')
population = pd.Series(
    {
        'California': 38332521,
        'Texas': 26448193,
        'New York': 19651127
    },
    name='population')

In [32]:
population / area
# The resulting array contains the union of indices of the two input arrays

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [33]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

## Discretization & binning

### Creating bins using cut

In [108]:
ages = [19, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
# Let’s divide these into bins of 18 to 25, 26 to 35, 35 to 60, and finally 60 and older
bins = [18, 25, 35, 60, 100]
categories = pd.cut(ages, bins)
categories
# exclude left, include right - see that 18 is not included

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [109]:
pd.value_counts(categories)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

#### Creating own bin names

In [110]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [111]:
categories = pd.cut(ages, bins, labels=group_names)
categories

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

### Creating quantiles using qcut

#### Creating quartiles

In [114]:
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(0.621, 3.682], (-0.0347, 0.621], (-0.0347, 0.621], (-3.258, -0.678], (-3.258, -0.678], ..., (-0.0347, 0.621], (-0.0347, 0.621], (-0.678, -0.0347], (0.621, 3.682], (-0.678, -0.0347]]
Length: 1000
Categories (4, interval[float64]): [(-3.258, -0.678] < (-0.678, -0.0347] < (-0.0347, 0.621] < (0.621, 3.682]]

In [113]:
pd.value_counts(cats)

(0.666, 3.187]     250
(0.0478, 0.666]    250
(-0.66, 0.0478]    250
(-2.949, -0.66]    250
dtype: int64

#### Creating custom quantiles

In [116]:
data = np.random.randn(1000) # Normally distributed
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.347, -0.0375], (-3.241, -1.347], (-1.347, -0.0375], (-1.347, -0.0375], (-0.0375, 1.219], ..., (-1.347, -0.0375], (1.219, 3.587], (-1.347, -0.0375], (-0.0375, 1.219], (-1.347, -0.0375]]
Length: 1000
Categories (4, interval[float64]): [(-3.241, -1.347] < (-1.347, -0.0375] < (-0.0375, 1.219] < (1.219, 3.587]]

## Detecting and Filtering Outliers

In [122]:
np.random.seed(12345)
data = pd.DataFrame(np.random.randn(1000, 4)) 
print(data.head())
# normally distributed (row, col)
print(data.describe())
# Quick overview of statistics tools

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570
                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

### find values in column 3 exceeding three in magnitude

In [126]:
col = data[3]
# Select column 3

In [128]:
col[np.abs(col)>3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

### Return all rows with values exceeding 3

In [135]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

## Permutation and Random Sampling (Randomly reorder df)

In [140]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5, 4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [141]:
sampler_index = np.random.permutation(len(df))

In [145]:
df.take(sampler_index)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

### Taking the first k elements of a randomly permuted array

In [146]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3

### Random sampling from a bag

In [153]:
bag = np.arange(1,54,1)
# Poker cards
sampler = np.random.randint(0, len(bag), size=20)

draws = bag.take(sampler)
draws

array([43, 14, 31, 12, 42, 16, 16, 31, 15, 11, 15,  7, 48, 17,  4, 31,  6,
       37, 38, 45])

## Computing dummy variables

In [157]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [156]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0